{
  "content_id": "bltef0afa1318ac8c67_en-us",
  "content_type": "content_block",
  "template": "Accordion",
  "theme":"Line",
  "locale": "en-us",
  "title": "Specific Guidance for Content Creators",
  "section_title": "Elements",
  "hash_tag_name": "Elements",
  "body": "<p>Guidance for the most commonly used and asked-about assets and site features is below. Please ask if you have questions about others or would like to see a new section added: webops.pdl@broadcom.com</p>",
  "items": [
    {
      "content_id": "## CS ID",
      "title": "Creating successful hero banners",
      "body": "<p dir=\"ltr\">&nbsp;</p><p dir=\"ltr\">Despite a natural and creative instinct to do so, it is not recommended or supported to include hero banner imagery on every <a href=\"http://www.broadcom.com/\">www.broadcom.com</a> page. The guidelines below will help you create your banner, should one be warranted and approved.</p><h5 dir=\"ltr\">When to use hero imagery&nbsp;&nbsp;</h5><p dir=\"ltr\">Use it on marketing-oriented pages, i.e. products, solutions and campaign (/info) pages:&nbsp;</p><ul dir=\"ltr\"><li role=\"presentation\">Use clear messaging and/or positioning&nbsp;</li><li role=\"presentation\">Employ a clear call-to-action for the message box&nbsp;</li></ul><h5 dir=\"ltr\">When not to&nbsp;&nbsp;</h5><p dir=\"ltr\">Do not use it on support or other utility pages:</p><ul dir=\"ltr\"><li role=\"presentation\">Support&nbsp;users are intensely mission oriented and do not appreciate the distraction of marketing messages&nbsp;</li><li role=\"presentation\">They are looking for something to fix their problem now, not to engage with the buyer's journey</li><li role=\"presentation\">Adding hero imagery pushes key content further down a page, increasing the friction&nbsp;a user experiences when looking for the information they need&nbsp;</li></ul><h5 dir=\"ltr\">Creating your hero banner</h5><p dir=\"ltr\">The message box:</p><ul dir=\"ltr\"><li role=\"presentation\">Should have a message and should not repeat the title&nbsp;of the page, or be considered the title of the page or product name.</li><li role=\"presentation\">Does not require a secondary line (subtitle). If used, the subtitle should support the title.</li><li role=\"presentation\">The message box title should be 30-60 characters. Correct for widows.</li><li role=\"presentation\">The subtitle should be 55-125 characters but depends on the length of the main title (a longer title leaves less room for a long subtitle). Watch for widowed text.</li><li role=\"presentation\">A call-to-action is recommended. If you are going to push key content down the page with your hero, at least provide&nbsp;the most important call-to-action in the message box.</li><li role=\"presentation\">Broadcom best practice is for one CTA in the hero banner.&nbsp; Make it easy for the user to figure out what you want them to do; what is the most important CTA on the page?&nbsp;</li></ul><h5>Obtaining art for your&nbsp;banner</h5><ul dir=\"ltr\"><li><a href=\"https://imagelibrary.broadcom.com/cloud/\" target=\"_blank\">Broadcom Image Library</a> (via Okta): All employees can use licensed stock images or icons for business-related projects.</li><li role=\"presentation\"><a href=\"http://123rf.com/\" target=\"_blank\">123rf.com</a>: If you do not find any suitable image in our Image Library, you can browse our authorized image vendor 123rf.com for more options and send the image ID and link to brand-list@broadcom.com.&nbsp; We will work with you to determine if it can be purchased and used and added to our library.</li><li role=\"presentation\">Creative Services: If you need a custom banner, submit a job request via Okta &gt; <a href=\"https://imagelibrary.broadcom.com/bp/#/\" target=\"_blank\">Creative Services</a>. Include graphic/image samples that represent your subject matter.&nbsp; Normal turnaround is 3-5 business days.</li></ul><h5 dir=\"ltr\">Examples: Hero imagery done well</h5><p dir=\"ltr\"><a href=\"https://www.broadcom.com/info/wifi6e\" target=\"_blank\">https://www.broadcom.com/info/wifi6</a></p><p dir=\"ltr\"><a href=\"https://www.broadcom.com/products/cyber-security/endpoint/hybrid-cloud\">https://www.broadcom.com/products/cyber-security/endpoint/hybrid-cloud</a>&nbsp;<br /></p>"
    },
    {
      "title": "Tips for using the Rich Text Editor (RTE)",
      "body": "<nav data-v-59de8b36=\"\">\n<p></p><h5>Bulleted lists styling</h5>\n<p><strong></strong>We differ from AP here, using bullets instead of dashes and preferring to end short phrases without periods. However, do use parallel constructions (same voice and verb tense for each item), and if your phrasing becomes long and is constructed in complete sentences -- add the periods.</p>\n<h5><br></h5><h5>Inserting links&nbsp;</h5>\n<p>Our best practice is to open the link in a new tab if it resolves to anything other than www.broadcom.com</p>\n\n<p>&nbsp;</p>\n</nav>"
    },
    {
      "title": "Choosing images for your page — copyright and licenses",
      "body": "<p><br></p>\n\n<p>All images on <a href=\"http://broadcom.com/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://broadcom.com/&source=gmail&ust=1651790782046000&usg=AOvVaw0dNyz6aqLzIcUzJIP7iUUn\">broadcom.com</a> must abide by Broadcom copyright and licensing agreements and policies. It is safe to use images from the <a href=\"https://imagelibrary.broadcom.com/cloud/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://imagelibrary.broadcom.com/cloud/&source=gmail&ust=1651790782046000&usg=AOvVaw1oXenuLxbWA0sDQgjhQsDk\">Broadcom Image Library</a> (via Okta login page &gt; <a href=\"https://broadcom.okta.com/home/broadcomlimitedplatformprod_broadcomimagelibrary_1/0oae2xwz5sSKC4QzU0x7/alne2y9kwk2WfrUmJ0x7\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://broadcom.okta.com/home/broadcomlimitedplatformprod_broadcomimagelibrary_1/0oae2xwz5sSKC4QzU0x7/alne2y9kwk2WfrUmJ0x7&source=gmail&ust=1651790782046000&usg=AOvVaw3cfw8n24a-N3gnvo9-z6mA\">Broadcom Creative Services</a>).  Never use any image without clear copyright or usage permissions, such as images downloaded from Internet searches, social media, third-party collateral, etc.<br><br><strong>Stock Asset Vendor</strong><br>If our current Image Library collection does not meet your needs, you can browse our stock image vendor <a href=\"https://www.123rf.com/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.123rf.com/&source=gmail&ust=1651790782046000&usg=AOvVaw3ZIvgchAjAD3PFG5OcIifh\">123rf.com</a> for more options. Send the image ID and/or link to <a href=\"mailto:brand-list@broadcom.com\" target=\"_blank\">brand-list@broadcom.com</a>.  We will work with you to determine if it can be purchased and used.</p>\n<p>  Note: Avoid content marked as \"Editorial Use Only\" as it cannot be used for general marketing, commercials or any form of commercial advertising as the content depicts newsworthy events or celebrities.</p>"
    },
    {
      "title": "CTA best practices",
      "body": "<p>Give users a clear idea of what information they'll find once they click on your link:</p><ul><li>Low-information links create confusion and are rarely clicked on</li><li>Too-vague CTAs aren't helpful (<em>Explore, Engage, Connect, etc.</em>)</li><li>Overly conversational CTAs can be awkward or seem condescending and manipulative  (<em>I want to...</em>)</li></ul><p>Read more about the \"low-information scent\" from the Nielsen-Norman Group:  </p><p><a href=\"https://www.nngroup.com/articles/3-ia-mistakes/\" target=\"_blank\">3 Common IA Mistakes (that Are All Due to Low Information Scent)</a></p><p></p><p></p><p></p><p></p>"
    },
    {
      "title": "Common grammar questions",
      "body": "<p>Copy on www.broadcom.com follows guidance from the AP Style Guide, a writing and editing reference for newsrooms and corporations worldwide. Here are some of the most-referenced entries.</p><h5>time</h5><p><span>When referring to times of day, use the following format: 8 a.m. or 4:30 p.m.</span></p><h5><span>em dash, en dash, hyphen</span></h5><p><span>Use&nbsp;<em>hyphens</em>&nbsp;as joiners, such as for compound modifiers:&nbsp;<em>small-business owner</em>. AP also uses&nbsp;<em>hyphens</em>&nbsp;for ranges, such as&nbsp;<em>Jan. 1-4</em>. There should be no spaces surrounding a hyphen.</span></p><p><span>AP does not use&nbsp;<em>en dashes, </em>though you will frequently see it come in with copy. It is about half the width of an&nbsp;<em>em dash</em>, approximating the width of a capital letter&nbsp;<em>N</em>. These should be edited into either hyphens or em dashes according to context. Use your judgment.</span></p><p><span>AP refers to <em>em dashes</em> simply as&nbsp;<em>dashes.</em>&nbsp;They are used to signal abrupt change; as one option to set off a series within a phrase; before attribution to an author or composer in some formats; after datelines; and to start lists.&nbsp;<strong>AP style calls for a space on both sides of a&nbsp;dash&nbsp;in all uses. </strong>An&nbsp;<em>em dash</em>&nbsp;is approximately the width of a capital letter&nbsp;<em>M.</em></span></p><h5><span>commas in a simple series</span></h5><p><span>Use commas to separate elements in a series, but do not put a (serial or Oxford) comma before the conjunction in most simple series:&nbsp;<em>His grandchildren are Vera, Chuck and Dave. He would nominate Marquez, Bedi, Lyman or Wong. She goes to school, plays league soccer and takes private dance lessons.</em></span></p><p><span></span></p>"
    },
    {
      "title": "FAQs",
      "body": "<p>How do I</p><h5>...get messages about my team's products in the corporate social media channels?</h5><p>A:&nbsp; Talk with your PR contact for guidance.</p><h5>...get CMS access to create my own content for the website?</h5><p>A: Chances are, someone in your division is already creating the webpages and blogs that market your products, so check around. If not, request access via a Web & Digital form from the Okta dash.</p><h5>...receive more training on the CMS?</h5><p>A:&nbsp; Study up. Everything you need to know is here in the <a href=\"https://sites.google.com/broadcom.com/cms-training/home\" target=\"_blank\">Training Guide</a>. If you still find yourself at a dead end needing assistance&nbsp;-- and have already chatted with&nbsp;Contentstack Support (instructions at the bottom of the Training Guide site) -- contact the Web Team via a Web & Digital ticket, accessed from your Okta dash.</p><p></p>"
    }
  ]
}